{
    "AAPL": {
        "symbol": "AAPL",
        "price": 218.27,
        "beta": 1.178,
        "volAvg": 52373281,
        "mktCap": 3278873767000,
        "lastDiv": 1,
        "range": "164.08-260.1",
        "changes": 4.17,
        "companyName": "Apple Inc.",
        "currency": "USD",
        "cik": "0000320193",
        "isin": "US0378331005",
        "cusip": "037833100",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Consumer Electronics",
        "website": "https://www.apple.com",
        "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts, as well as advertising services include third-party licensing arrangements and its own advertising platforms. In addition, the company offers various subscription-based services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was founded in 1976 and is headquartered in Cupertino, California.",
        "ceo": "Mr. Timothy D. Cook",
        "sector": "Technology",
        "country": "US",
        "fullTimeEmployees": "150000",
        "phone": "(408) 996-1010",
        "address": "One Apple Park Way",
        "city": "Cupertino",
        "state": "CA",
        "zip": "95014",
        "dcfDiff": 52.30477,
        "dcf": 165.96522516743,
        "image": "https://images.financialmodelingprep.com/symbol/AAPL.png",
        "ipoDate": "1980-12-12",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "AMZN": {
        "symbol": "AMZN",
        "price": 196.21,
        "beta": 1.192,
        "volAvg": 38398472,
        "mktCap": 2079374717000,
        "lastDiv": 0,
        "range": "151.61-242.52",
        "changes": 1.26,
        "companyName": "Amazon.com, Inc.",
        "currency": "USD",
        "cik": "0001018724",
        "isin": "US0231351067",
        "cusip": "023135106",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Specialty Retail",
        "website": "https://www.amazon.com",
        "description": "Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions through online and physical stores in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). Its products offered through its stores include merchandise and content purchased for resale; and products offered by third-party sellers The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, Blink, eero, and Echo; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products in its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program. The company serves consumers, sellers, developers, enterprises, content creators, and advertisers. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.",
        "ceo": "Mr. Andrew R. Jassy",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "1556000",
        "phone": "206 266 1000",
        "address": "410 Terry Avenue North",
        "city": "Seattle",
        "state": "WA",
        "zip": "98109-5210",
        "dcfDiff": 162.14293,
        "dcf": 34.06707187225967,
        "image": "https://images.financialmodelingprep.com/symbol/AMZN.png",
        "ipoDate": "1997-05-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "GOOGL": {
        "symbol": "GOOGL",
        "price": 163.99,
        "beta": 1.025,
        "volAvg": 29206730,
        "mktCap": 2011461356614,
        "lastDiv": 0.8,
        "range": "147.22-207.05",
        "changes": 1.19,
        "companyName": "Alphabet Inc.",
        "currency": "USD",
        "cik": "0001652044",
        "isin": "US02079K3059",
        "cusip": "02079K305",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Internet Content & Information",
        "website": "https://www.abc.xyz",
        "description": "Alphabet Inc. provides various products and platforms in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment offers products and services, including ads, Android, Chrome, hardware, Gmail, Google Drive, Google Maps, Google Photos, Google Play, Search, and YouTube. It is also involved in the sale of apps and in-app purchases and digital content in the Google Play store; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in the provision of YouTube non-advertising services. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar, and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services. The company was founded in 1998 and is headquartered in Mountain View, California.",
        "ceo": "Mr. Sundar  Pichai",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "183323",
        "phone": "650 253 0000",
        "address": "1600 Amphitheatre Parkway",
        "city": "Mountain View",
        "state": "CA",
        "zip": "94043",
        "dcfDiff": -91.01422,
        "dcf": 255.00422352290317,
        "image": "https://images.financialmodelingprep.com/symbol/GOOGL.png",
        "ipoDate": "2004-08-19",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "META": {
        "symbol": "META",
        "price": 596.25,
        "beta": 1.231,
        "volAvg": 15573920,
        "mktCap": 1510694363588,
        "lastDiv": 2.025,
        "range": "414.5-740.91",
        "changes": 10.25,
        "companyName": "Meta Platforms, Inc.",
        "currency": "USD",
        "cik": "0001326801",
        "isin": "US30303M1027",
        "cusip": "30303M102",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Internet Content & Information",
        "website": "https://investor.fb.com",
        "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was incorporated in 2004 and is headquartered in Menlo Park, California.",
        "ceo": "Mr. Mark Elliot Zuckerberg",
        "sector": "Communication Services",
        "country": "US",
        "fullTimeEmployees": "74067",
        "phone": "650 543 4800",
        "address": "1601 Willow Road",
        "city": "Menlo Park",
        "state": "CA",
        "zip": "94025",
        "dcfDiff": -3.96001,
        "dcf": 600.2100081275669,
        "image": "https://images.financialmodelingprep.com/symbol/META.png",
        "ipoDate": "2012-05-18",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "MSFT": {
        "symbol": "MSFT",
        "price": 391.26,
        "beta": 0.914,
        "volAvg": 22425491,
        "mktCap": 2908619014800,
        "lastDiv": 3.16,
        "range": "376.91-468.35",
        "changes": 4.42,
        "companyName": "Microsoft Corporation",
        "currency": "USD",
        "cik": "0000789019",
        "isin": "US5949181045",
        "cusip": "594918104",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Software - Infrastructure",
        "website": "https://www.microsoft.com",
        "description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Skype for Business; Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. The Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related Client Access Licenses; GitHub that provides a collaboration platform and code hosting service for developers; Nuance provides healthcare and enterprise AI solutions; and Azure, a cloud platform. It also offers enterprise support, Microsoft consulting, and nuance professional services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. The More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. Microsoft Corporation was founded in 1975 and is headquartered in Redmond, Washington.",
        "ceo": "Mr. Satya  Nadella",
        "sector": "Technology",
        "country": "US",
        "fullTimeEmployees": "228000",
        "phone": "425 882 8080",
        "address": "One Microsoft Way",
        "city": "Redmond",
        "state": "WA",
        "zip": "98052-6399",
        "dcfDiff": 0.84152,
        "dcf": 390.41848300277735,
        "image": "https://images.financialmodelingprep.com/symbol/MSFT.png",
        "ipoDate": "1986-03-13",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "TSLA": {
        "symbol": "TSLA",
        "price": 248.71,
        "beta": 2.507,
        "volAvg": 89457367,
        "mktCap": 799980689200,
        "lastDiv": 0,
        "range": "138.8-488.54",
        "changes": 12.45,
        "companyName": "Tesla, Inc.",
        "currency": "USD",
        "cik": "0001318605",
        "isin": "US88160R1014",
        "cusip": "88160R101",
        "exchange": "NASDAQ Global Select",
        "exchangeShortName": "NASDAQ",
        "industry": "Auto - Manufacturers",
        "website": "https://www.tesla.com",
        "description": "Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. It operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners; and provision of service and repairs to its energy product customers, including under warranty, as well as various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas.",
        "ceo": "Mr. Elon R. Musk",
        "sector": "Consumer Cyclical",
        "country": "US",
        "fullTimeEmployees": "125665",
        "phone": "512 516 8177",
        "address": "1 Tesla Road",
        "city": "Austin",
        "state": "TX",
        "zip": "78725",
        "dcfDiff": 192.2648,
        "dcf": 56.44520367842881,
        "image": "https://images.financialmodelingprep.com/symbol/TSLA.png",
        "ipoDate": "2010-06-29",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
}