{
    "600000.SS": {
        "symbol": "600000.SS",
        "price": 13.44,
        "beta": 0.509,
        "volAvg": 69267887,
        "mktCap": 406754880000,
        "lastDiv": 0.321,
        "range": "8.19-14.8",
        "changes": -0.04,
        "companyName": "Shanghai Pudong Development Bank Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000011B7",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.spdb.com.cn",
        "description": "Shanghai Pudong Development Bank Co., Ltd. provides commercial banking products and services in the People's Republic of China. The company offers various personal banking services, including savings and account management products; wealth management services comprising open-ended funds, special investments, SPDB structured deposits, security investment custody accounts, individual FX trading, collective security investments, and insurance products distribution; cards; lending services, such as deposit/treasury bond pledged loans and car mortgages; online payment and consumption services; and instant messaging services. It also provides corporate banking services consisting of corporate cash management solutions, ebanking solutions, supply chain financing solutions, asset custody solutions, occupational pension products, and trade finance services; and investment banking and offshore banking services, as well as services to small and medium enterprises, and multi-national companies. In addition, the company offers treasury and market products, including foreign exchange risk management, interest rate risk management, structural, fixed income, and commodity exchange products. As of December 31, 2020, it had 1,640 branches. Shanghai Pudong Development Bank Co., Ltd. was founded in 1992 and is headquartered in Shanghai, the People's Republic of China.",
        "ceo": "Weizhong Zhang",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "62987",
        "phone": "86 21 6161 8888",
        "address": "No. 12, Zhongshang Dong Yi Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200002",
        "dcfDiff": -20.15515,
        "dcf": 33.59514525708606,
        "image": "https://images.financialmodelingprep.com/symbol/600000.SS.png",
        "ipoDate": "1999-11-10",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600016.SS": {
        "symbol": "600016.SS",
        "price": 5.41,
        "beta": 0.382,
        "volAvg": 213200612,
        "mktCap": 228740239604,
        "lastDiv": 0.216,
        "range": "3.25-5.68",
        "changes": 0.07,
        "companyName": "China Minsheng Banking Corp., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000015Y0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.cmbc.com.cn",
        "description": "China Minsheng Banking Corp., Ltd. provides various financial products and services to individuals, small and micro-enterprises, corporate customers, government agencies, and financial institutions in the People's Republic of China. The company operates through Corporate Banking, Retail Banking, and Others segments. Its deposit products include saving accounts, deposit certificates, contracted deposits, agreement deposits, call deposits, corporate term deposits, and corporate current deposits. The company also offers personal housing mortgage, individual automobile purchase, household composite consumption, home, medium and long term, and short-term working capital loans; micro-credit products for individuals; debit and credit cards; and safe deposit boxes. In addition, it provides payment and collection, and clearing services, as well as internet, mobile, and telephone banking services. Further, the company offers gross settlement; wages distribution agency and letter of guarantee; cash management; trade finance; industrial chain finance; individual forex settlement, forex remittance, travelers promissory notes, collection, individual deposit certificate, and guarantee letter products; and comprehensive credit granting, forex settlement and sale, financial product investment, and trust financing services. Additionally, it provides convenient finance, investment banking, and asset management services, as well as non-financial services in the education, business travel, traveler, art, luxury life, health, club, and isports areas. As of December 31, 2021, the company has approximately 140 branch-level institutions, 1,193 business outlets, 1,078 community sub-branches, and 136 small business sub-branches. China Minsheng Banking Corp., Ltd. was founded in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "ceo": "Yingxin Gao",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "63490",
        "phone": "86 10 5856 0975",
        "address": "China Minsheng Bank Building",
        "city": "Beijing",
        "state": null,
        "zip": "100031",
        "dcfDiff": 7.32678,
        "dcf": -3.3067792014170894,
        "image": "https://images.financialmodelingprep.com/symbol/600016.SS.png",
        "ipoDate": "2000-12-19",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600019.SS": {
        "symbol": "600019.SS",
        "price": 7.04,
        "beta": 0.746,
        "volAvg": 68365602,
        "mktCap": 150490599375,
        "lastDiv": 0.21,
        "range": "5.5-7.65",
        "changes": 0.1,
        "companyName": "Baoshan Iron & Steel Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000015R4",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Steel",
        "website": "https://www.baosteel.com",
        "description": "Baoshan Iron & Steel Co., Ltd. engages in the manufacture and sale of iron and steel products for automobile, home appliances, petrochemical, machinery manufacturing, energy, transportation, and other industries in China and internationally. The company offers hot-rolled (HR) steel products, including HR wear resistant steel, clad-rolled flat steel, and HR protection steel; HR pickled automotive steel sheets; cold rolled (CR) steel sheet products, such as CR automotive steel sheets, hot-dip galvanized steel for HVAC ductwork, tin plates and tin free steel, grain oriented electrical steel, pre-painted steel sheets, and others; heavy plates; pipes and tubes; bar and wire rods; stainless steel; special steel, which includes tool and die steel, alloy plates and sheets, structural steel long products, and special metallurgical products; and carbon steel sheets, as well as aluminized steel plates, color coated plates, and related coating products. It also engages in the provision of asset management and technology development, transfer, and consulting, as well as technical services in the field of metallurgical technology; construction machinery and metallurgical equipment maintenance; design, production, installation, and maintenance of mechanical and electrical equipment; import and export of goods and technology; production and sales of chemical raw materials; research, design, development, manufacturing, and integration of computers, automation, network communication systems, and software and hardware products; steel trading; research and development of laser tailor-welded blank products. In addition, the company offers transportation, warehousing, and postal services. The company was founded in 2000 and is based in Shanghai, China.",
        "ceo": "Baojun Liu",
        "sector": "Basic Materials",
        "country": "CN",
        "fullTimeEmployees": "46048",
        "phone": "86 21 2664 7000",
        "address": "Baosteel Administration Center",
        "city": "Shanghai",
        "state": null,
        "zip": "201999",
        "dcfDiff": -11.61988,
        "dcf": 18.65988026483486,
        "image": "https://images.financialmodelingprep.com/symbol/600019.SS.png",
        "ipoDate": "2000-12-12",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600028.SS": {
        "symbol": "600028.SS",
        "price": 5.73,
        "beta": 0.739,
        "volAvg": 126519996,
        "mktCap": 653370544244,
        "lastDiv": 0.28,
        "range": "5.25-7.64",
        "changes": -0.03,
        "companyName": "China Petroleum & Chemical Corporation",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000018G1",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Oil & Gas Integrated",
        "website": "https://www.sinopec.com",
        "description": "China Petroleum & Chemical Corporation, an energy and chemical company, engages in the oil and gas and chemical operations in Mainland China, Singapore, and internationally. It operates through five segments: Exploration and Production, Refining, Marketing and Distribution, Chemicals, and Corporate and Others. The company explores and develops oil fields; produces crude oil and natural gas; processes and purifies crude oil; and manufactures and sells petroleum products. It also owns and operates oil depots and service stations; and distributes and sells refined petroleum products, including gasoline and diesel through wholesale and retail sales networks. In addition, the company manufactures and sells petrochemical and derivative petrochemical products; and other chemical products, such as basic organic chemicals, synthetic resins, synthetic fiber monomers and polymers, synthetic fibers, synthetic rubber, and chemical fertilizers. Further, it is involved in the exploration, production, and sale of petroleum and natural gas; production, storage, and sale of petrochemical and coal chemical products; import and export of petroleum products, natural gas, petrochemical, and chemical products; production and sale of catalyst products, lubricant base oil, polyester chips and fibers, plastics, and intermediate petrochemical products; research, development, production, and sale of ethylene and downstream byproducts; provision of geophysical exploration, drilling, survey, logging, downhole operational services, and construction services, as well as crude oil jetty services and natural gas pipeline transmission services; manufacturing production equipment; and coal chemical industry investment management activities. The company was incorporated in 2000 and is headquartered in Beijing, China. China Petroleum & Chemical Corporation is a subsidiary of China Petrochemical Corporation.",
        "ceo": "Dong Zhao",
        "sector": "Energy",
        "country": "CN",
        "fullTimeEmployees": "355952",
        "phone": "86 10 5996 0028",
        "address": "No. 22 Chaoyangmen North Street",
        "city": "Beijing",
        "state": null,
        "zip": "100728",
        "dcfDiff": 2.29382,
        "dcf": 3.4361844701584157,
        "image": "https://images.financialmodelingprep.com/symbol/600028.SS.png",
        "ipoDate": "2001-08-08",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600029.SS": {
        "symbol": "600029.SS",
        "price": 5.69,
        "beta": 0.616,
        "volAvg": 47184329,
        "mktCap": 92497203600,
        "lastDiv": 0,
        "range": "5.18-7.49",
        "changes": 0,
        "companyName": "China Southern Airlines Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001FG0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Airlines, Airports & Air Services",
        "website": "https://www.csair.com",
        "description": "China Southern Airlines Company Limited offers airline transportation services in the People's Republic of China, Hong Kong, Macau, Taiwan, and internationally. The company operates in two segments, Airline Transportation Operations and Other Segments. It offers passenger, cargo, mail delivery, and other extended transportation services. The company also provides aircraft repair and maintenance, air catering, cargo handling, logistics, freight, airport ground, and general aviation services; and import and export agency, flight simulation, leasing, and pilot training services, as well as hotel management and tour services. It operates a fleet of 879 commercial aircraft and 28 civil helicopters. The company was incorporated in 1995 and is headquartered in Guangzhou, the People's Republic of China.",
        "ceo": "Xulun Ma CPA",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "102597",
        "phone": "86 20 8611 2480",
        "address": "China Southern Air Building",
        "city": "Guangzhou",
        "state": null,
        "zip": "510403",
        "dcfDiff": 0.57605,
        "dcf": 5.3639464672411945,
        "image": "https://images.financialmodelingprep.com/symbol/600029.SS.png",
        "ipoDate": "2003-07-25",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600030.SS": {
        "symbol": "600030.SS",
        "price": 28.25,
        "beta": 0.978,
        "volAvg": 82318626,
        "mktCap": 394472316359,
        "lastDiv": 0.715,
        "range": "18.26-36.49",
        "changes": 0.17,
        "companyName": "CITIC Securities Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001DB6",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Financial - Capital Markets",
        "website": "https://www.cs.ecitic.com",
        "description": "CITIC Securities Company Limited provides various financial products and services in Mainland China and internationally. It operates through Investment Banking, Brokerage, Trading, Asset Management, and Others segments. The company offers investment banking services, including equity and debt financing, as well as fundraising and financial advisory services to a range of enterprises and other institutional clients. It is also involved in the broking of securities and futures; distribution of financial products; and trading and market-making of equity products, fixed income products and derivatives, foreign exchange, margin financing and securities lending, alternative investment, and commodities business. In addition, the company offers asset management services, such as collective asset management, specialized asset management, separately managed account, fund management, and other investment accounts management; private equity investment and other services; and custody and research services. Further, it provides institutional brokerage, investment advisory and management, investment consultancy, fiduciary management, fund, real estate, business training, and financial products and securities investment services. Additionally, the company offers finance outsourcing, bond issuance, offshore portfolio hedge and investment fund, fund distribution, leveraged foreign exchange and other transactions, investment with self-owned capital, cash transactions, property management and leasing, and other services. It also engages in information technology development, technical consulting, research and development of financial products, portfolio design, and consulting activities. CITIC Securities Company Limited was incorporated in 1995 and is based in Beijing, the People's Republic of China.",
        "ceo": "Youjun Zhang",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "26781",
        "phone": "86 10 6083 6030",
        "address": "CITIC Securities Tower",
        "city": "Beijing",
        "state": null,
        "zip": "100026",
        "dcfDiff": -57.02082,
        "dcf": 85.68082342102161,
        "image": "https://images.financialmodelingprep.com/symbol/600030.SS.png",
        "ipoDate": "2003-01-06",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600031.SS": {
        "symbol": "600031.SS",
        "price": 18.84,
        "beta": 1.105,
        "volAvg": 44591964,
        "mktCap": 158405723647,
        "lastDiv": 0.36,
        "range": "14.85-20.76",
        "changes": 0.13,
        "companyName": "Sany Heavy Industry Co., Ltd",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001F70",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Agricultural - Machinery",
        "website": "https://www.sanyhi.com",
        "description": "Sany Heavy Industry Co., Ltd. engages in the research and development, manufacture, and sale of construction machinery worldwide. It offers concrete machinery, excavators, hoisting machinery, pile driving machinery, and road construction machinery. The company also provides concrete pump trucks, concrete trailer pumps, concrete mixing trucks, cranes, lifting machinery, concrete mixing stations, drilling rigs, road rollers, pavers, graders, asphalt mixing equipment, etc. In addition, it offers mortgage and other financial services for buyers of construction machinery. The company was founded in 1994 and is based in Beijing, China.",
        "ceo": "Hongfu Yu",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "25363",
        "phone": "86 10 6073 8666",
        "address": "Sany Industrial Park",
        "city": "Beijing",
        "state": null,
        "zip": "102206",
        "dcfDiff": 12.62015,
        "dcf": 6.219854115075639,
        "image": "https://images.financialmodelingprep.com/symbol/600031.SS.png",
        "ipoDate": "2003-07-03",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600036.SS": {
        "symbol": "600036.SS",
        "price": 45,
        "beta": 1.038,
        "volAvg": 57556638,
        "mktCap": 1153180139265,
        "lastDiv": 1.972,
        "range": "29.93-48.55",
        "changes": -0.11,
        "companyName": "China Merchants Bank Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001B33",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.cmbchina.com",
        "description": "China Merchants Bank Co., Ltd., together with its subsidiaries, provides various banking products and services. It operates through Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company offers current, demand, time, call, savings, notice, and renminbi accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; joint guarantee, special guarantee, and housing mortgage loan; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantees for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross-border RMB clearing, and interbank services; and risk and financial management, cross-border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, investment and wealth management, forex option and gold trading, forex express trading, international, offshore and private banking, custody, pension, and electronic banking services. As of December 31, 2021, it operated 143 branches; 1,770 sub-branches; one branch-level operation center; 2,812 self-service centers; 6,592 self-service machines; one representative office; 14,746 visual counters in Mainland China. The company also operates in Hong Kong, New York, London, Singapore, Luxembourg, Sydney, and Taipei. China Merchants Bank Co., Ltd. was founded in 1987 and is headquartered in Shenzhen, China.",
        "ceo": "Liang Wang",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "117201",
        "phone": "86 755 8319 8888",
        "address": "China Merchants Bank Tower",
        "city": "Shenzhen",
        "state": null,
        "zip": "518040",
        "dcfDiff": -62.50873,
        "dcf": 107.54872708605255,
        "image": "https://images.financialmodelingprep.com/symbol/600036.SS.png",
        "ipoDate": "2002-04-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600048.SS": {
        "symbol": "600048.SS",
        "price": 7.99,
        "beta": 0.523,
        "volAvg": 89278931,
        "mktCap": 94804293516,
        "lastDiv": 0.41,
        "range": "7.3-12.13",
        "changes": 0.01,
        "companyName": "Poly Developments and Holdings Group Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001ND1",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Real Estate - Development",
        "website": "https://www.poly.com.cn/english/1919.html",
        "description": "Poly Developments and Holdings Group Co., Ltd. develops, invests in, operates, and manages real estate properties in China and internationally. The company develops residential and office buildings, hotels, shopping centers, etc. It also engages in the construction and agency businesses; exhibition services and venue rental business; catering business; Mercure business; and provision of engineering design, supervision, and consulting services. Poly Developments and Holdings Group Co., Ltd. was founded in 1992 and is headquartered in Guangzhou, China.",
        "ceo": "Zhihua Pan",
        "sector": "Real Estate",
        "country": "CN",
        "fullTimeEmployees": "49790",
        "phone": "86 20 8989 8233",
        "address": "Poly Development Plaza",
        "city": "Guangzhou",
        "state": null,
        "zip": "510308",
        "dcfDiff": -88.39769,
        "dcf": 98.64768600457165,
        "image": "https://images.financialmodelingprep.com/symbol/600048.SS.png",
        "ipoDate": "2006-07-31",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600050.SS": {
        "symbol": "600050.SS",
        "price": 5.38,
        "beta": 0.761,
        "volAvg": 201181139,
        "mktCap": 162633862865,
        "lastDiv": 0.2104,
        "range": "4.43-6.93",
        "changes": -0.04,
        "companyName": "China United Network Communications Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001CS2",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Telecommunications Services",
        "website": "https://www.chinaunicom-a.com",
        "description": "China United Network Communications Limited, together with its subsidiaries, provides various telecommunication services in the People's Republic of China. It offers mobile broadband, fixed-line broadband, GSM, and fixed-line local telephone services; and information and communication technology, data communications, and other related value-added services. In addition, it offers cloud computing, big data, and Internet of Things services. As of December 31, 2021, the company has approximately 317.12 million mobile billing users. China United Network Communications Limited was founded in 2001 and is based in Beijing, the People's Republic of China.",
        "ceo": "Qin Jian",
        "sector": "Communication Services",
        "country": "CN",
        "fullTimeEmployees": "240617",
        "phone": "86 10 6625 9179",
        "address": "No. 21, Financial Street",
        "city": "Beijing",
        "state": null,
        "zip": "100033",
        "dcfDiff": -33.70522,
        "dcf": 37.77522095166885,
        "image": "https://images.financialmodelingprep.com/symbol/600050.SS.png",
        "ipoDate": "2002-10-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600104.SS": {
        "symbol": "600104.SS",
        "price": 17.92,
        "beta": 0.613,
        "volAvg": 36465414,
        "mktCap": 204734024607,
        "lastDiv": 0.37044,
        "range": "11.49-21.3",
        "changes": -0.02,
        "companyName": "SAIC Motor Corporation Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000000TY6",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Auto - Manufacturers",
        "website": "https://www.saicmotor.com",
        "description": "SAIC Motor Corporation Limited researches and develops, produces, and sells passenger and commercial vehicles in the People's Republic of China and internationally. Its auto parts and components include power drive systems; chassis; interior and exterior trims; and components and smart product systems for new energy vehicles, such as batteries, electric drives, and electronic controls. The company also provides logistics and transportation services, mobility services, automobile life-support services, energy-saving and charging service, etc.; chargers, photovoltaic power generators, hazardous waste disposal services, and power battery recycling solutions; and engages in the auto finance, corporate finance, insurance sales, and investment businesses. In addition, it engages in the research and development of automobiles; manufacture and sale of automobile transmissions, electricity-controlled burning oil products, engineering machinery facilities, and diesel engines and spare parts; equity and venture capital investment, industrial consulting and investment, asset and investment management, storage and consulting service, network technology, etc.; manufacturing and processing of machinery; real estate development and operation, and property management; and development, operation, leasing, and property and investment management of industrial workshops and supporting facilities. Further, the company offers sales and after-sales services; marketing, warehouse, and logistics services for automobiles; property management and innovation services, etc.; insurance agency, hospitality, beverage, and catering services; publishing and distribution services; automobile electronic systems and components; hardware and electricity components; building materials; and sells vehicles, electromechanical products, etc. The company is based in Shanghai, the People's Republic of China. SAIC Motor Corporation Limited is a subsidiary of Shanghai Automotive Industry Corporation (Group).",
        "ceo": "Jian Xu Jia",
        "sector": "Consumer Cyclical",
        "country": "CN",
        "fullTimeEmployees": "187739",
        "phone": "86 21 2201 1888",
        "address": "No. 489 Weihai Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200041",
        "dcfDiff": -21.24819,
        "dcf": 39.1681927404115,
        "image": "https://images.financialmodelingprep.com/symbol/600104.SS.png",
        "ipoDate": "1997-11-25",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600276.SS": {
        "symbol": "600276.SS",
        "price": 57.73,
        "beta": 0.385,
        "volAvg": 46132129,
        "mktCap": 365975587630,
        "lastDiv": 1.63766,
        "range": "39.62-58.28",
        "changes": 0.51,
        "companyName": "Jiangsu Hengrui Medicine Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000014W7",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Drug Manufacturers - General",
        "website": "https://www.hrs.com.cn",
        "description": "Jiangsu Hengrui Medicine Co., Ltd., a pharmaceutical company, researches, develops, manufactures, and commercializes medicine worldwide. The company is developing Apatinib, Pyrotinib, Mecapegfilgrastim, SHR3680, SHR3162, SHR9549, SHR2554, SHR1459, SHR-1309, SHR-A1201, Camrelizumab, Famitinib, SHR-1316, SHR-1501, SHR-1603, SHR-1701, SHR-1702, and SHR-A1403 for oncology, metabolic, pain, autoimmune, and other indications. The company was founded in 1970 and is based in Lianyungang, China.",
        "ceo": "Piao Yang Sun",
        "sector": "Healthcare",
        "country": "CN",
        "fullTimeEmployees": "20238",
        "phone": "86 518 8122 0983",
        "address": "38 Huanghe Rd Eco & Tech Dev Park",
        "city": "Lianyungang",
        "state": null,
        "zip": "222000",
        "dcfDiff": 25.41421,
        "dcf": 32.3157873388102,
        "image": "https://images.financialmodelingprep.com/symbol/600276.SS.png",
        "ipoDate": "2000-10-18",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600309.SS": {
        "symbol": "600309.SS",
        "price": 55.15,
        "beta": 0.806,
        "volAvg": 23735051,
        "mktCap": 173157212500,
        "lastDiv": 5.75994,
        "range": "52.1-100.4",
        "changes": 0.31,
        "companyName": "Wanhua Chemical Group Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000016J9",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Chemicals",
        "website": "https://www.whchem.com",
        "description": "Wanhua Chemical Group Co., Ltd. engages in the research and development, production, and sale of polyurethane series products, petrochemical products, and fine chemicals and new materials worldwide. The company offers polyols, thermoplastic elastomers, petrochemicals, aliphatic isocyanate products, specialty amine products; aroma, nutrition, and performance chemicals; and diisocyantes and its derivatives, polyether polyols for flexible and rigid foam, and PU systems, as well as ethylene oxide derivatives. Further, it offers surface materials and new energy materials, thermoplastic polyurethane elastomers, polymethyl methacrylate(PMMA), mebrane material, PMMA resin and compounds, modified polypropylene, polycarbonates, silicone polycarbonates, long chain polyamide, and bio-degradable materials. Its products are used in various applications, including appliances/cold chain, elastomers, electronics, clothing/footwear, industrial mechanical, furniture/bedding, building/construction, sealants, automotive and transportation, coatings, sports/leisure, adhesives, home and personal care, and others. The company was formerly known as Yantai Wanhua Polyurethanes Co., Ltd. and changed its name to Wanhua Chemical Group Co., Ltd. in June 2013. Wanhua Chemical Group Co., Ltd. was founded in 1978 and is headquartered in Yantai, China.",
        "ceo": "Guangwu Kou",
        "sector": "Basic Materials",
        "country": "CN",
        "fullTimeEmployees": "33303",
        "phone": "400 960 0309",
        "address": "No.3, Sanya Road",
        "city": "Yantai",
        "state": null,
        "zip": "264006",
        "dcfDiff": 97.19257,
        "dcf": -40.93257175241729,
        "image": "https://images.financialmodelingprep.com/symbol/600309.SS.png",
        "ipoDate": "2001-01-05",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600340.SS": {
        "symbol": "600340.SS",
        "price": 2.23,
        "beta": 0.862,
        "volAvg": 136686040,
        "mktCap": 8682192800,
        "lastDiv": 0,
        "range": "1.01-4.15",
        "changes": 0.01,
        "companyName": "China Fortune Land Development Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001GG8",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Real Estate - Development",
        "website": "https://www.cfldcn.com",
        "description": "China Fortune Land Development Co., Ltd. engages in the investment, development, construction, and operation of new industrial cities and commercial real estate in China, Indonesia, and internationally. The company was formerly known as China Fortune Real Estate Development Co., Ltd. and changed its name to China Fortune Land Development Co., Ltd. in December 2007. The company was founded in 1998 and is headquartered in Beijing, China.",
        "ceo": "Huaizhou Chen",
        "sector": "Real Estate",
        "country": "CN",
        "fullTimeEmployees": "10191",
        "phone": "86 10 5911 5055",
        "address": "Jiacheng Plaza",
        "city": "Beijing",
        "state": null,
        "zip": "100027",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/600340.SS.png",
        "ipoDate": "2003-12-30",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600519.SS": {
        "symbol": "600519.SS",
        "price": 1416.35,
        "beta": 0.866,
        "volAvg": 2767350,
        "mktCap": 1777685387855,
        "lastDiv": 51.555,
        "range": "1245.83-1910",
        "changes": 5.32,
        "companyName": "Kweichow Moutai Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000018R8",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Beverages - Wineries & Distilleries",
        "website": "https://www.moutaichina.com",
        "description": "Kweichow Moutai Co., Ltd. produces and sells wine and liquor products in China and internationally. It offers aged, ordinary, and other Maotai liquor products. Kweichow Moutai Co., Ltd. was founded in 1999 and is based in Renhuai, China.",
        "ceo": "Wang Li",
        "sector": "Consumer Defensive",
        "country": "CN",
        "fullTimeEmployees": "34750",
        "phone": "86 85 1223 86002",
        "address": "Maotai Town",
        "city": "Renhuai",
        "state": null,
        "zip": "564501",
        "dcfDiff": -769.16328,
        "dcf": 2185.513280414536,
        "image": "https://images.financialmodelingprep.com/symbol/600519.SS.png",
        "ipoDate": "2001-08-27",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600585.SS": {
        "symbol": "600585.SS",
        "price": 22.35,
        "beta": 0.759,
        "volAvg": 17809043,
        "mktCap": 116275692937,
        "lastDiv": 0.71,
        "range": "19.53-28.75",
        "changes": 0.02,
        "companyName": "Anhui Conch Cement Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE0000019V8",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Construction Materials",
        "website": "https://www.conch.cn",
        "description": "Anhui Conch Cement Company Limited, together with its subsidiaries, manufactures, sells, and trades in clinker and cement products. The company conducts its operations through five segments, which include Eastern China, Central China, Southern China, Western China, and Overseas. It provides construction and installation services for industrial purposes; logistic services; and mining and related services. The company manufactures and sells cement packaging products, concrete products, and refractory materials; and develops and sells profile and related products, as well as exports clinker and cement products. In addition, it engages in investment and trading; and selling aggregates. Anhui Conch Cement Company Limited was founded in 1997 and is based in Wuhu, the People's Republic of China.",
        "ceo": "Jun Yang",
        "sector": "Basic Materials",
        "country": "CN",
        "fullTimeEmployees": "49397",
        "phone": "86 5538398976",
        "address": "No. 39 Wenhua Road",
        "city": "Wuhu",
        "state": null,
        "zip": "241000",
        "dcfDiff": 6.67809,
        "dcf": 15.671911838369374,
        "image": "https://images.financialmodelingprep.com/symbol/600585.SS.png",
        "ipoDate": "2002-02-07",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600690.SS": {
        "symbol": "600690.SS",
        "price": 25.81,
        "beta": 0.729,
        "volAvg": 33551459,
        "mktCap": 226928062861,
        "lastDiv": 0.80131,
        "range": "23.1-35.37",
        "changes": 0.13,
        "companyName": "Haier Smart Home Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000000CG9",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Furnishings, Fixtures & Appliances",
        "website": "https://smart-home.haier.com",
        "description": "Haier Smart Home Co., Ltd. engages in the research, development, production, and sale of smart home appliances in Asia, Europe, the United States, Australia, Africa, and internationally. The company operates through three segments: China Smart Home Business, Overseas Home Appliance and Smart Home Business, and Other Business. It provides refrigerators, freezers, washing machines, air conditioners, water heaters, water purification products, dishwashers, gas stoves, kitchen appliances, small home appliances, and smart home scene solutions. The company also offers environmental protection and artificial intelligence technology consulting; software development; technical services and advertising design; IoT technology research and development; computer hardware and software technical services; and smart home appliances, as well as provides asset management and equity investment. In addition, it provides hazardous waste management services; develops, assemblies, and sells plastics and electronic products; develops home appliances, communications, electronic products, and network engineering technologies; and develops and produces precision plastics, sheet metal, molds, and electronic products for home appliances. The company was formerly known as Qingdao Haier Co., Ltd. and changed its name to Haier Smart Home Co., Ltd. in June 2019. Haier Smart Home Co., Ltd. was incorporated in 1984 and is headquartered in Qingdao, China.",
        "ceo": "Huagang Li",
        "sector": "Consumer Cyclical",
        "country": "CN",
        "fullTimeEmployees": "122733",
        "phone": "86 532 8893 1670",
        "address": "Haier Information Industry Park",
        "city": "Qingdao",
        "state": null,
        "zip": "266101",
        "dcfDiff": -26.67407,
        "dcf": 52.484068137049256,
        "image": "https://images.financialmodelingprep.com/symbol/600690.SS.png",
        "ipoDate": "1993-11-19",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600703.SS": {
        "symbol": "600703.SS",
        "price": 12.53,
        "beta": 0.716,
        "volAvg": 26264888,
        "mktCap": 60487376919,
        "lastDiv": 0.02,
        "range": "9.45-15.34",
        "changes": 0.19,
        "companyName": "Sanan Optoelectronics Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000000KB3",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Semiconductors",
        "website": "https://www.sanan-e.com",
        "description": "Sanan Optoelectronics Co., Ltd. engages in the research, development, production, and marketing of LED epitaxial wafers and chips, compound solar cells, compound semiconductors, semiconductor and communication chips, and sapphire substrates in China and internationally. Its LED lighting products include bulbs, tube lamps, down lights, spot lights, floodlights, fill lights, tunnel lights, and smart and horticulture lighting products primarily used in homes, shopping malls, hotels, office buildings, vertical farm, greenhouse, and public streets. The company also offers silicon carbide power diodes and silicon-based gallium nitride power devices; DFB lasers, photodiodes, avalanche photodiodes, and other optical communication products; and visible and infrared VCSELs, and edge-emitting lasers, as well as other products for 3D sensing, LiDAR, and other consumer applications. The company was founded in 2000 and is headquartered in Xiamen, China.",
        "ceo": "Ke Chuang Lin",
        "sector": "Technology",
        "country": "CN",
        "fullTimeEmployees": "15828",
        "phone": "86 59 2593 7001",
        "address": "NO.1721-1725 Lvling Road",
        "city": "Xiamen",
        "state": null,
        "zip": null,
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/600703.SS.png",
        "ipoDate": "1996-05-28",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "600837.SS": {
        "symbol": "600837.SS",
        "price": 10.41,
        "beta": 0.429,
        "volAvg": 39326957,
        "mktCap": 121101615102,
        "lastDiv": 0.13,
        "range": "7.63-13.83",
        "changes": 0,
        "companyName": "Haitong Securities Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000000CK1",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Financial - Capital Markets",
        "website": "https://www.htsec.com",
        "description": "Haitong Securities Co., Ltd. operates as a securities company primarily in Mainland China, Hong Kong, and Europe. It operates through Wealth Management, Investment Banking, Asset Management, Trading and Institution, Finance Lease, and Others segments. The Wealth Management segment offers securities and futures brokering and dealing, investment consulting, and wealth management services, as well as financial services, such as margin financing, securities lending, stock pledge, etc. The Investment Banking segment provides sponsoring and underwriting services in equity and debt capital markets; financial consulting services, which include merger and assets restructuring services; and services related to the national equities exchange and quotations. The Asset Management segment offers investment management services on investment products comprising asset, fund, and private equity management to individual, corporate, and institutional clients. The Trading and Institution segment provides stock sales and trading, prime brokerage, and stock lending and research services in financial markets; market-making services for fixed income, currency and commodity products, futures and options, and derivatives on various exchanges; and investment funds and private equity projects. The Finance Lease segment offers financial solutions that include finance and operating lease, factoring, entrustment loans, and related consulting services. The Others segment provides warehouse receipts pledge, pricing, and market-making services, as well as services related to risk management. The company also offers fund trading, distribution, and management services; financial and commodity futures contracts broking and dealing services; investment advisory and management services; banking services; and real estate development, property management, and catering management services. Haitong Securities Co., Ltd. was founded in 1988 and is based in Shanghai, the People's Republic of China.",
        "ceo": "Jun Li",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "13637",
        "phone": "86 40 0888 8001",
        "address": "Haitong Securities Building",
        "city": "Shanghai",
        "state": null,
        "zip": "200001",
        "dcfDiff": 5.79975,
        "dcf": 4.610247369426296,
        "image": "https://images.financialmodelingprep.com/symbol/600837.SS.png",
        "ipoDate": "1994-02-24",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": false,
        "isAdr": false,
        "isFund": false
    },
    "600887.SS": {
        "symbol": "600887.SS",
        "price": 28.1,
        "beta": 0.779,
        "volAvg": 35093170,
        "mktCap": 177742616000,
        "lastDiv": 1.22,
        "range": "21.13-31.96",
        "changes": 0.58,
        "companyName": "Inner Mongolia Yili Industrial Group Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000000JP5",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Packaged Foods",
        "website": "https://www.yili.com",
        "description": "Inner Mongolia Yili Industrial Group Co., Ltd. produces and sells dairy products in China and internationally. It offers liquid milk, milk powder, yoghourt, ice cream, and cheese, as well as packaged drinking water. The company was founded in 1956 and is based in Hohhot, China.",
        "ceo": "Gang Pan",
        "sector": "Consumer Defensive",
        "country": "CN",
        "fullTimeEmployees": "63414",
        "phone": "86 47 1338 8888",
        "address": "No.1 Jinshan Avenue",
        "city": "Hohhot",
        "state": null,
        "zip": "010110",
        "dcfDiff": -11.94644,
        "dcf": 40.046435134260996,
        "image": "https://images.financialmodelingprep.com/symbol/600887.SS.png",
        "ipoDate": "1996-03-12",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601066.SS": {
        "symbol": "601066.SS",
        "price": 25.75,
        "beta": 0.576,
        "volAvg": 10951075,
        "mktCap": 167263502500,
        "lastDiv": 0.25,
        "range": "18.41-33.12",
        "changes": 0.88,
        "companyName": "CSC Financial Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000031T5",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Financial - Capital Markets",
        "website": "https://www.csc108.com",
        "description": "CSC Financial Co., Ltd., together with its subsidiaries, provides investment banking services in Mainland China and internationally. The company operates through four segments: Investment Banking, Wealth Management, Trading and Institutional Client Services, and Asset Management. The Investment Banking segment offers financial advisory, sponsoring, and equity and debt securities underwriting services. The Wealth Management segment provides brokerage agency services for corporate and personal clients in the trading of equity stocks, funds, bonds, and futures, as well as margin financing and securities lending services. The Trading and Institutional Client Services segment trades in financial products; and offers brokerage agency services for financial institutions in the trading of equity stocks, funds, and bonds, as well as margin financing and securities lending services. This segment also provides services in relation to the sale of financial products to institutional clients, and specialized research and advisory services. The Asset Management segment develops asset management and fund management products, as well as offers private placement offerings and related services. The company was formerly known as China Securities Finance Co., Ltd. CSC Financial Co., Ltd. was founded in 2005 and is based in Beijing, China.",
        "ceo": "Cheng Liu",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "13045",
        "phone": "86 10 8513 0588",
        "address": "No. 188 Chaonei Avenue",
        "city": "Beijing",
        "state": null,
        "zip": "100010",
        "dcfDiff": -11.53696,
        "dcf": 37.286962489483415,
        "image": "https://images.financialmodelingprep.com/symbol/601066.SS.png",
        "ipoDate": "2018-06-27",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601088.SS": {
        "symbol": "601088.SS",
        "price": 37.13,
        "beta": 0.479,
        "volAvg": 24471064,
        "mktCap": 709150453104,
        "lastDiv": 2.26,
        "range": "34.78-47.5",
        "changes": -0.15,
        "companyName": "China Shenhua Energy Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000767",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Coal",
        "website": "https://www.csec.com",
        "description": "China Shenhua Energy Company Limited and its subsidiaries engage in the production and sales of coal and power; railway, port, and shipping transportation; and coal-to-olefins businesses in the People's Republic of China and internationally. It operates through six segments: Coal, Power, Railway, Port, Shipping, and Coal Chemical. The Coal segment produces coal from surface and underground mines; and sells coal to power plants, metallurgical and coal chemical producers, and provincial/regional electric grid companies. As of December 31, 2021, this segment had the recoverable coal reserves of 14.15 billion tones. The Power segment generates electric power through thermal, wind, water, and gas; and sells electric power to power grid companies. The Railway segment provides railway transportation services. The Port segment offers loading, transportation, and storage services. The Shipping segment provides shipment transportation services. The Coal Chemical segment produces and sells methanol; and polyethylene and polypropylene, as well as other by-products. The company was incorporated in 2004 and is based in Beijing, the People's Republic of China. China Shenhua Energy Company Limited is a subsidiary of China Energy Investment Corporation Limited.",
        "ceo": "Changyan Zhang",
        "sector": "Energy",
        "country": "CN",
        "fullTimeEmployees": "83351",
        "phone": "86 10 5813 1088",
        "address": "22 Andingmen Xibinhe Road",
        "city": "Beijing",
        "state": null,
        "zip": "100011",
        "dcfDiff": -27.78807,
        "dcf": 64.91807323182981,
        "image": "https://images.financialmodelingprep.com/symbol/601088.SS.png",
        "ipoDate": "2007-10-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601111.SS": {
        "symbol": "601111.SS",
        "price": 7.38,
        "beta": 0.474,
        "volAvg": 56261049,
        "mktCap": 118028555740,
        "lastDiv": 0,
        "range": "6.17-9.12",
        "changes": -0.1,
        "companyName": "Air China Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001NN0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Airlines, Airports & Air Services",
        "website": "https://www.airchina.com.cn",
        "description": "Air China Limited, together with its subsidiaries, provides air passenger, air cargo, and airline-related services in Mainland China, Hong Kong, Macau, Taiwan, Europe, North America, Japan, Korea, the Asia Pacific, and internationally. The company operates through Airline Operations and Other Operations segments. It provides aircraft engineering and airport ground handling services. The company is also involved in the import and export trading activities; and provision of cabin, airline catering, air ticketing, human resources, aircraft overhaul and maintenance, and financial services. As of December 31, 2021, it owned and operated 746 passenger aircraft, including business jets. The company was founded in 1988 and is based in Beijing, the People's Republic of China. Air China Limited is a subsidiary of China National Aviation Holding Corporation Limited.",
        "ceo": "Mingyuan Wang",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "104909",
        "phone": "86 10 6146 2560",
        "address": "Building 1",
        "city": "Beijing",
        "state": null,
        "zip": "101312",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/601111.SS.png",
        "ipoDate": "2006-08-18",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601138.SS": {
        "symbol": "601138.SS",
        "price": 27.5,
        "beta": 1.055,
        "volAvg": 101412252,
        "mktCap": 546136250000,
        "lastDiv": 0.58,
        "range": "14.58-28.3",
        "changes": 0.77,
        "companyName": "Foxconn Industrial Internet Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000031P3",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Communication Equipment",
        "website": "https://www.fii-foxconn.com",
        "description": "Foxconn Industrial Internet Co., Ltd. engages in the research and development, design, manufacturing, and sale of communication network equipment, cloud service equipment, precision tools, and industrial robots. Its communication network equipment products include network equipment, such as network switches, routers, wireless devices, network servers, STB/OTT boxes, and smart home gateways; telecommunication equipment comprising mobile base stations, optical transmission equipment, etc.; and communication network equipment high-precision machine components, consisting of smartphone high-precision metal and polymer machine components, and network telecommunication equipment high-precision machine components. The company also provides cloud computing products, including tower, rack, and blade servers; storage devices and servers; data centers; and storage cabinets. In addition, the company offers precision tools solutions, including diamond cutters, tungsten carbide cutters, and micro thread forming taps, as well as tool development, production systems, blade design, mass production, precision coating, and application testing services; and industrial robotics automation and industrial internet solutions. Its products are used in smartphones, broadband and wireless networks, infrastructure of multimedia service operators and telecom operators, terminal products for Internet value-added service providers, infrastructure of enterprise networks and data centers, and automatic manufacturing of precision core components. The company was incorporated in 2015 and is based in Shenzhen, China. Foxconn Industrial Internet Co., Ltd. is a subsidiary of Hon Hai Precision Industry Co., Ltd.",
        "ceo": "Hungmeng Cheng",
        "sector": "Technology",
        "country": "CN",
        "fullTimeEmployees": "191521",
        "phone": "86 755 3385 5777",
        "address": "C1, Foxconn Technology Park",
        "city": "Shenzhen",
        "state": null,
        "zip": "518109",
        "dcfDiff": 7.89622,
        "dcf": 19.60377975132752,
        "image": "https://images.financialmodelingprep.com/symbol/601138.SS.png",
        "ipoDate": "2018-06-13",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601166.SS": {
        "symbol": "601166.SS",
        "price": 24.29,
        "beta": 0.768,
        "volAvg": 62127558,
        "mktCap": 514044412000,
        "lastDiv": 1.06,
        "range": "15.68-25.45",
        "changes": -0.02,
        "companyName": "Industrial Bank Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001QZ7",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.cib.com.cn",
        "description": "Industrial Bank Co., Ltd. provides banking services in the People's Republic of China. The company's banking services include accepting deposits from the public; granting short-term, medium-term, and long-term loans; domestic and overseas settlement services; issuance of discount and financial bonds; acceptance bills and notes; agency issue and encashment; underwriting and trading of government bonds and debentures; trading of financial bonds; agency trading and trading of marketable securities except stock; asset custody business; and inter-bank lending and borrowings. It also trades in, settles, and sells foreign exchange, as well as provides bank cards; agency trading services; letters of credit and letters of guarantee; remittance and insurance agent services; safety deposit box services; financial advisory services; credit investigation, advisory, and attestation services; and other banking services. In addition, the company, through its subsidiaries, is involved in finance leasing, trust, fund raising and marketing, asset management, consumer finance, equity investment, and industrial investment; investment management, advisory, and consulting; and financial, business, and enterprise management consulting; financial data processing, commodity and financial futures brokerage, futures investment consulting, and economic information consulting; application software development and operational, and system integration services. Further, it engages in investment and assets management; acquisition, transfer, and disposal of bad debts of financial and non-financial institutions; issuance of wealth management products; wealth management consulting and advisory services; and other banking activities. Additionally, the company offers debit and credit card, and internet and mobile banking services. Industrial Bank Co., Ltd. was founded in 1988 and is headquartered in Fuzhou, the People's Republic of China.",
        "ceo": "Jiajin Lyu",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "68716",
        "phone": "86 591 8782 4863",
        "address": "No. 154 Hudong Road",
        "city": "Fuzhou",
        "state": null,
        "zip": "350003",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/601166.SS.png",
        "ipoDate": "2007-02-05",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601186.SS": {
        "symbol": "601186.SS",
        "price": 8.27,
        "beta": 0.381,
        "volAvg": 30587910,
        "mktCap": 105803672840,
        "lastDiv": 0.35,
        "range": "6.72-10.31",
        "changes": 0.02,
        "companyName": "China Railway Construction Corporation Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000009T1",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Engineering & Construction",
        "website": "https://www.crcc.cn",
        "description": "China Railway Construction Corporation Limited, together with its subsidiaries, operates as an integrated construction company in Mainland China and internationally. It operates through five segments: Construction Operations; Survey, Design and Consultancy Operations; Manufacturing Operations; Real Estate Development Operations; and Other Business Operations. The Construction Operations segment engages in the construction of infrastructure, such as railways, highways, metropolitan railways, and real estate projects; and bridges, tunnels, airports, and wharfs, as well as housing, municipal engineering, water conservancy, and hydropower. The Survey, Design and Consultancy Operations segment provides survey, design, and consultancy services for civil engineering and infrastructure construction, such as railways, highways, and urban rail transport, etc. The Manufacturing Operations segment is involved in the research and development, production, and sale of mechanical equipment comprising railway track maintenance and tunnel boring machinery, as well as manufactures track system, etc. The Real Estate Development Operations segment engages in the development, construction, and sale of residential and commercial properties. The Other Business Operations segment includes trade and logistics, finance and insurance brokerage, and highway operations. The company was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China. China Railway Construction Corporation Limited is a subsidiary of China Railway Construction Corporation.",
        "ceo": "Hegen Dai",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "264045",
        "phone": "86 10 5188 8114",
        "address": "East No. 40 Fuxing Road",
        "city": "Beijing",
        "state": null,
        "zip": "100855",
        "dcfDiff": 10.81932,
        "dcf": -2.42932053925861,
        "image": "https://images.financialmodelingprep.com/symbol/601186.SS.png",
        "ipoDate": "2008-03-10",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601211.SS": {
        "symbol": "601211.SS",
        "price": 19.3,
        "beta": 0.295,
        "volAvg": 76412219,
        "mktCap": 311979019591,
        "lastDiv": 0.15,
        "range": "13.46-22.08",
        "changes": 0.05,
        "companyName": "Guotai Junan Securities Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000022F3",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Financial - Capital Markets",
        "website": "https://www.gtja.com",
        "description": "Guotai Junan Securities Co., Ltd. provides various financial services for individuals and institutional clients in Mainland China, Hong Kong, and internationally. It operates through Wealth Management Business, Investment Banking Business, Institutional and Trading Business, Investment Management Business, and International Business segments. The company offers securities and futures brokerage, financial products, investment advisory, margin financing and securities lending, securities repurchase, and stock pledging and other services; listing sponsorship, equity underwriting, debt underwriting, structured debt financing, M&A financial advisory, and diversified corporate solutions to corporate and governmental clients; institutional brokerage, trading, investment and equity investment, seat leasing, custody and outsourcing, QFII, and other services; and investment transactions in stocks, fixed income, foreign exchange, and commodities and their derivative financial instruments, as well as integrated financial solutions for clients' investment, financing, and risk management. It also provides asset management and fund management services; and brokerage, corporate finance, asset management, and loans and financing services, as well as financial products, and market making and investment services. In addition, the company offers real estate and property management, warehouse service, corporate management consulting, venture capital investment and management, investment management, industrial investment, and investment consulting services. The company was founded in 1992 and is based in Shanghai, China.",
        "ceo": "Jian Zhu",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "14523",
        "phone": "86 40 0888 8666",
        "address": "768 Nanjing West Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200041",
        "dcfDiff": -28.85325,
        "dcf": 46.65324512680341,
        "image": "https://images.financialmodelingprep.com/symbol/601211.SS.png",
        "ipoDate": "2015-06-26",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601229.SS": {
        "symbol": "601229.SS",
        "price": 10.85,
        "beta": 0.237,
        "volAvg": 60555153,
        "mktCap": 154167650000,
        "lastDiv": 1.85916,
        "range": "6.75-11.47",
        "changes": -0.05,
        "companyName": "Bank of Shanghai Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100002FM5",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.bosc.cn",
        "description": "Bank of Shanghai Co., Ltd. provides various personal and corporate banking products and services primarily in Mainland China. It operates through Wholesale Financial Business, Retail Financial Business, and Other Business segments. The company accepts current, time-demand, fixed, education, individual call, interest-on-interest, and foreign exchange deposits. Its loan products include license plate loans, loans for individual studies, and individual housing loans; and fixed asset loans, liquidity revolving loans, mortgage loans, syndicated loans, corporation overdrafts, and working capital loans. The company also offers debit and credit cards; open-ended funds; certificate and savings bonds; and unit-linked, annuities, health, and life insurance products. In addition, it provides settlement services, such as cheque, cashier's order, bank and trade acceptance, remittance, collection with acceptance, consignment collection, and periodical credit and charge services; and intermediary services comprising tender, performance, advance payment, quality and maintenance guarantee, and payment guarantee, as well as entrusted loan of unit and credit certification services. Further, the company offers supply chain services consisting of advance payment financing, chattel mortgage credit extension, accounts receivable financing, credit insurance financing, auto dealer financing, order financing, and domestic letter of credit services; and online, mobile, and telephone banking services. Additionally, it offers investment banking, asset custody, equity investment, wealth management, securities agency, and pension finance services. The company was formerly known as Shanghai City United Bank Ltd. and changed its name to Bank of Shanghai Co., Ltd. in July 1998. Bank of Shanghai Co., Ltd. was incorporated in 1995 and is headquartered in Shanghai, China.",
        "ceo": "Hongmin Shi",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "14890",
        "phone": "86 21 6847 6988",
        "address": "No. 168, Middle Yincheng Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200120",
        "dcfDiff": -19.53884,
        "dcf": 29.988844792291204,
        "image": "https://images.financialmodelingprep.com/symbol/601229.SS.png",
        "ipoDate": "2016-11-16",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601288.SS": {
        "symbol": "601288.SS",
        "price": 6.13,
        "beta": 0.254,
        "volAvg": 382733352,
        "mktCap": 2124217815808,
        "lastDiv": 0.1164,
        "range": "4.38-6.51",
        "changes": -0.16,
        "companyName": "Agricultural Bank of China Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000RJ0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Diversified",
        "website": "https://www.abchina.com",
        "description": "Agricultural Bank of China Limited provides corporate and retail banking products and services. The company operates through Corporate Banking, Personal Banking, and Treasury Operations segments. It offers demand, personal call, foreign currency time, foreign currency call, time or demand optional, foreign exchange demand, foreign exchange call, foreign exchange time, certificates of deposit, savings, agreed-term, and negotiated deposits; and loans comprise housing, consumer, business, fixed asset, working capital, real estate, and entrusted syndicated loans, as well as trade finances, guarantees and commitments, and loans with custody of export rebates accounts. The company also provides credit card, debit card, payment and settlement, private banking, cash management, investment banking, custody, financial market, and financial institution services, as well as trading and wealth management services; and personal fund collection and automatic transfer services. In addition, it offers agro-related personal and corporate banking products and services; personal and online, telephone, mobile, self-service, television, and SMS banking services; financial leasing services; fund management services; assets custodian services; debt-to-equity swap and related services; and life, health, and accident insurance, as well as reinsurance products. As of December 31, 2021, the company had 22,807 domestic branches, including three specialized institutions, 4 training institutes, 37 tier-1 branches, 402 tier-2 branches, 3,348 tier-1 sub-branches, 18,961 foundation-level branch outlets and 50 other establishments; and 13 overseas branches in Hong Kong, Singapore, Seoul, New York, Dubai International Financial Centre, Tokyo, Frankfurt, Sydney, Luxemburg, Dubai, London, Macao, and Hanoi; and four overseas representative offices in Vancouver, Taipei, Sao Paulo, and Dushanbe. Agricultural Bank of China Limited was founded in 1951 and is based in Beijing, the People's Republic of China.",
        "ceo": "Shu Gu",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "454716",
        "phone": "86 10 8510 9619",
        "address": "No. 69, Jianguomen Nei Avenue",
        "city": "Beijing",
        "state": null,
        "zip": "100005",
        "dcfDiff": -6.91461,
        "dcf": 11.144608662769942,
        "image": "https://images.financialmodelingprep.com/symbol/601288.SS.png",
        "ipoDate": "2010-07-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601318.SS": {
        "symbol": "601318.SS",
        "price": 56.81,
        "beta": 0.911,
        "volAvg": 49129366,
        "mktCap": 968273179945,
        "lastDiv": 2.55,
        "range": "40.22-62.8",
        "changes": -0.02,
        "companyName": "Ping An Insurance (Group) Company of China, Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001R84",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Insurance - Life",
        "website": "https://www.pingan.com",
        "description": "Ping An Insurance (Group) Company of China, Ltd. provides financial products and services for insurance, banking, asset management, and fintech and healthtech businesses in the People's Republic of China. The company's Life and Health Insurance segment offers term, whole-life, endowment, annuity, investment-linked, universal life, and health care and medical insurance to individual and corporate customers. Its Property and Casualty Insurance segment provides auto, non-auto, and accident and health insurance to individual and corporate customers. The company's Banking segment undertakes loan and intermediary businesses with corporate and retail customers; and offers wealth management and credit card services to individual customers. Its Trust segment provides trust services; and undertakes investing activities. The company's Securities segment offers brokerage, trading, investment banking, and asset management services. Its Other Asset Management segment provides investment management, finance lease, and other asset management services. The company's Technology segment offers financial and daily-life services through internet platforms, such as financial transaction information service platform, and health care service platform. It also provides annuity insurance, investment management, IT and business process outsourcing, real estate investment, futures brokerage, consulting, project investment, financial advisory, currency brokerage, property agency, fund raising and distribution, real estate development and leasing, and insurance agency services. In addition, the company provides factoring, equity investment, financing guarantee, logistics, management consulting, e-commerce, credit information, and private equity financing services; and operates an expressway, as well as produces and sells consumer chemicals. Ping An Insurance (Group) Company of China, Ltd. was founded in 1988 and is based in Shenzhen, China.",
        "ceo": "Yonglin Xie",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "273053",
        "phone": "86 40 0886 6338",
        "address": "Ping An Finance Center",
        "city": "Shenzhen",
        "state": null,
        "zip": "518033",
        "dcfDiff": 14.46044,
        "dcf": 37.49956205105424,
        "image": "https://images.financialmodelingprep.com/symbol/601318.SS.png",
        "ipoDate": "2007-03-01",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601319.SS": {
        "symbol": "601319.SS",
        "price": 8.36,
        "beta": 0.538,
        "volAvg": 88869150,
        "mktCap": 342245581545,
        "lastDiv": 0.063,
        "range": "5.31-9.19",
        "changes": 0.02,
        "companyName": "The People's Insurance Company (Group) of China Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100003F27",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Insurance - Property & Casualty",
        "website": "https://www.picc.com",
        "description": "The People's Insurance Company (Group) of China Limited, an investment holding company, engages in the insurance business in the People's Republic of China. It operates through Non-Life Insurance, Life Insurance, Health Insurance, Asset Management, and Others segments. The company offers property and casualty insurance products, including motor vehicle, commercial property, liability, credit, accidental injury and health, cargo, agricultural, and other insurance products. It also provides life insurance products comprising general life and health insurance, participating life insurance, universal life insurance, and accident insurance; and health insurance products, such as medical, illness, nursing care, accidental injury, disability losses, and participating endowment insurance products. In addition, the company engages in asset management, insurance agent, and reinsurance business, as well as offers integrated financial products and services. The People's Insurance Company (Group) of China Limited was founded in 1949 and is based in Beijing, the People's Republic of China.",
        "ceo": "Xiangqun Ding",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "175121",
        "phone": "86 10 6900 9192",
        "address": "No. 88, West Chang'an Street",
        "city": "Beijing",
        "state": null,
        "zip": "100031",
        "dcfDiff": -7.66925,
        "dcf": 14.499249308494885,
        "image": "https://images.financialmodelingprep.com/symbol/601319.SS.png",
        "ipoDate": "2018-11-23",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601328.SS": {
        "symbol": "601328.SS",
        "price": 7.99,
        "beta": 0.239,
        "volAvg": 129804744,
        "mktCap": 654945324200,
        "lastDiv": 0.754,
        "range": "6.42-8.34",
        "changes": -0.03,
        "companyName": "Bank of Communications Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000000S2",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Diversified",
        "website": "https://www.bankcomm.com",
        "description": "Bank of Communications Co., Ltd. provides commercial banking products and services. The company offers personal banking products and services, including demand, time, call, withdrawal, foreign currency, swap management, and education deposits, as well as certificate of deposits; credit and debit cards; housing and personal loans; and wealth management products, and wealth management advisory and consulting services. It also provides corporate banking products and services, such as corporate time and demand structured deposits; cash management services, such as accounts receivable/accounts payable management, account management, liquidity management, and investment and financing management; financing, settlement, and risk management services; financing services; syndicated loans; overdrafts; investment banking services; offshore banking services, including forex deposit and loan, inter-bank loan, international settlement, forex trading and guarantee, business advisory, and other services; and precious metal leasing and commodity trading services. In addition, the company offers international banking services comprising corporate foreign exchange wealth management, import and export settlement, document settlement, remittance and bill, trade finance, and offshore banking services. Further, it provides treasury, asset management, trustee, insurance, financial leasing, debt-to-equity swap, and other financial services; trust investment, fund management, securities dealing and brokerage, and reinsurance services; and e-banking services. It has 245 branches and 3,025 banking outlets in Mainland China; 22 overseas branches and 68 overseas banking outlets, as well as representative offices in 17 countries. Bank of Communications Co., Ltd. was founded in 1908 and is headquartered in Shanghai, the People's Republic of China.",
        "ceo": "Deqi Ren",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "95746",
        "phone": "86 21 5876 6688",
        "address": "188 Yin Cheng Zhong Lu",
        "city": "Shanghai",
        "state": null,
        "zip": "200120",
        "dcfDiff": -14.87142,
        "dcf": 22.311424972219907,
        "image": "https://images.financialmodelingprep.com/symbol/601328.SS.png",
        "ipoDate": "2007-05-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601336.SS": {
        "symbol": "601336.SS",
        "price": 61.14,
        "beta": 0.878,
        "volAvg": 16875233,
        "mktCap": 173755386577,
        "lastDiv": 1.39,
        "range": "28.51-63.43",
        "changes": 0.33,
        "companyName": "New China Life Insurance Company Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000019Y0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Insurance - Life",
        "website": "https://www.newchinalife.com",
        "description": "New China Life Insurance Company Ltd. provides life insurance products and services to individuals and institutions in the People's Republic of China. It operates through three segments: Individual Insurance Business, Group Insurance Business, and Other Business. The company also offers asset management, training, electronic commerce, and medical services; and invests in, develops, leases, and manages real estate properties. New China Life Insurance Company Ltd. was incorporated in 1996 and is headquartered in Beijing, the People's Republic of China.",
        "ceo": "Yucheng Yang",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "28675",
        "phone": "86 10 8521 3233",
        "address": "New China Insurance Tower",
        "city": "Beijing",
        "state": null,
        "zip": "100022",
        "dcfDiff": -104.94033,
        "dcf": 166.08032895461727,
        "image": "https://images.financialmodelingprep.com/symbol/601336.SS.png",
        "ipoDate": "2011-12-16",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601390.SS": {
        "symbol": "601390.SS",
        "price": 5.76,
        "beta": 0.465,
        "volAvg": 65426156,
        "mktCap": 132840758431,
        "lastDiv": 0.21,
        "range": "4.95-7.23",
        "changes": 0.01,
        "companyName": "China Railway Group Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000866",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Engineering & Construction",
        "website": "https://www.crec.cn",
        "description": "China Railway Group Limited, together with its subsidiaries, operates as an integrated construction company in the People's Republic of China, Hong Kong, and Macau. Its Infrastructure Construction segment constructs railways, highways, bridges, tunnels, metropolitan railways, buildings, irrigation works, hydroelectricity projects, ports, docks, airports, and other municipal works. The company's Survey, Design and Consulting Services segment provides survey, design, consulting, research and development, feasibility study, and compliance certification services to infrastructure construction projects. Its Engineering Equipment and Component Manufacturing segment designs, researches and develops, manufactures, and sells turnouts, bridge steel structures, other railway-related equipment, engineering machinery, and materials. The company's Property Development segment develops, sells, and manages residential and commercial properties. Its Other Businesses segment is involved in mining, financial, service concession arrangements operation, merchandise trading, and other ancillary businesses. China Railway Group Limited was founded in 1950 and is headquartered in Beijing, China.",
        "ceo": "Wenjian Chen",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "297359",
        "phone": "86 10 5184 5225",
        "address": "Block A",
        "city": "Beijing",
        "state": null,
        "zip": "100039",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/601390.SS.png",
        "ipoDate": "2007-12-03",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601398.SS": {
        "symbol": "601398.SS",
        "price": 7.75,
        "beta": 0.296,
        "volAvg": 311691087,
        "mktCap": 2620693328423,
        "lastDiv": 0.4498,
        "range": "5.45-8.36",
        "changes": -0.05,
        "companyName": "Industrial & Commercial Bank of China Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001P37",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Diversified",
        "website": "https://www.icbc-ltd.com",
        "description": "Industrial and Commercial Bank of China Limited, together with its subsidiaries, provides banking products and services in the People's Republic of China and internationally. It operates through Corporate Banking, Personal Banking, and Treasury Operations segments. The Corporate Banking segment offers financial products and services to corporations, government agencies, and financial institutions. Its products and services include corporate loans, trade financing, deposit taking activities, corporate wealth management services, custody activities, and various corporate intermediary services. The Personal Banking segment provides financial products and services to individual customers. This segment's products and services comprise personal loans and cards, deposits, and personal wealth management and intermediary services. The Treasury Operations segment is involved in the money market transactions, investment securities, and foreign exchange transactions businesses, as well as in the holding of derivative positions. It also offers e-banking services, investment banking, financial leasing, and insurance services. The company was founded in 1984 and is based in Beijing, the People's Republic of China.",
        "ceo": "Lin Liao",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "415159",
        "phone": "86 10 6610 6114",
        "address": "55 Fuxingmennei Avenue",
        "city": "Beijing",
        "state": null,
        "zip": "100140",
        "dcfDiff": -12.24523,
        "dcf": 19.05522835142486,
        "image": "https://images.financialmodelingprep.com/symbol/601398.SS.png",
        "ipoDate": "2006-10-27",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601601.SS": {
        "symbol": "601601.SS",
        "price": 37.75,
        "beta": 0.836,
        "volAvg": 29401572,
        "mktCap": 332369160921,
        "lastDiv": 1.02,
        "range": "26.83-43.01",
        "changes": -0.03,
        "companyName": "China Pacific Insurance (Group) Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000008M8",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Insurance - Life",
        "website": "https://www.cpic.com.cn",
        "description": "China Pacific Insurance (Group) Co., Ltd., together with its subsidiaries, offers insurance products in the People's Republic of China. It operates through Life and Health Insurance, Property and Casualty Insurance, and Other Businesses segments. The company offers life, health, and accident insurance products, etc.; liability insurance; credit and guarantee insurance; short-term health insurance and casualty insurance; property insurance; agricultural insurance; and individual and group pension and annuity products, as well as insurance funds investment and reinsurance services. It is also involved in the management of capital and insurance funds; outsourcing of fund management; and other asset management activities, as well as provision of advisory services relating to asset management. In addition, the company is involved in the property management and construction; real estate activities; elderly service and medical consulting services; and seniors and disabled care services. It sells its products directly, as well as through insurance agents and brokers, bancassurance, telemarketing, and internet Sales. The company was founded in 1991 and is headquartered in Shanghai, the People's Republic of China.",
        "ceo": "Fan Fu",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "94990",
        "phone": "86 21 5876 7282",
        "address": "No.1 South Zhongshan Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200010",
        "dcfDiff": 20.97267,
        "dcf": 11.227326779709129,
        "image": "https://images.financialmodelingprep.com/symbol/601601.SS.png",
        "ipoDate": "2007-12-25",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601628.SS": {
        "symbol": "601628.SS",
        "price": 39.85,
        "beta": 0.586,
        "volAvg": 11519705,
        "mktCap": 957039690013,
        "lastDiv": 0.63,
        "range": "28.96-50.88",
        "changes": 0.13,
        "companyName": "China Life Insurance Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001Q93",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Insurance - Life",
        "website": "https://www.e-chinalife.com",
        "description": "China Life Insurance Company Limited, together with its subsidiaries, operates as a life insurance company in the People's Republic of China. The company operates in four segments: Life Insurance Business, Health Insurance Business, Accident Insurance Business, and Other Businesses. It offers critical illness protection, annuity, children/women/pension, security, life, medical, and accident protection insurance products. The company was founded in 1949 and is based in Beijing, the People's Republic of China. China Life Insurance Company Limited is a subsidiary of China Life Insurance (Group) Company Limited.",
        "ceo": "Xiliang Cai",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "98689",
        "phone": "86 10 6363 3333",
        "address": "16 Financial Street",
        "city": "Beijing",
        "state": null,
        "zip": "100033",
        "dcfDiff": -11.79512,
        "dcf": 51.645118137375654,
        "image": "https://images.financialmodelingprep.com/symbol/601628.SS.png",
        "ipoDate": "2007-01-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601668.SS": {
        "symbol": "601668.SS",
        "price": 5.82,
        "beta": 0.422,
        "volAvg": 156757892,
        "mktCap": 236981761164,
        "lastDiv": 0.27,
        "range": "4.72-6.79",
        "changes": 0,
        "companyName": "China State Construction Engineering Corporation Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000F46",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Engineering & Construction",
        "website": "https://www.cscec.com.cn",
        "description": "China State Construction Engineering Corporation Limited operates as an integrated construction and real estate company primarily in China. It operates in five segments: Building Construction Engineering; Infrastructure Construction and Investment; Real Estate Development and Investment; Prospecting and Design; and Others. It undertakes housing construction; and infrastructure projects of urban rail transit, high-speed rail, bridges, expressways, municipal roads, urban integrated pipe corridors, ports and waterways, electric power, mining, metallurgy, petrochemicals, airports, and nuclear power plants. The company is also involved in the real estate development, financing, investment for construction projects and integrated urban construction; and architectural design, urban planning, engineering survey, public utility design, and other fields, such as airports, hotels, sports facilities, exhibition venues, ancient architecture, and super high-rise buildings. In addition, it engages in building science and technology, environmental protection for water, e-commerce, and financial businesses. The company was founded in 1982 and is headquartered in Beijing, China. China State Construction Engineering Corporation Limited is a subsidiary of China State Construction Engineering Corporation.",
        "ceo": "Wen Bing",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "361249",
        "phone": "86 10 8649 8888",
        "address": "China Construction Fortune Int. Center",
        "city": "Beijing",
        "state": null,
        "zip": "100029",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/601668.SS.png",
        "ipoDate": "2009-07-29",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601688.SS": {
        "symbol": "601688.SS",
        "price": 18.27,
        "beta": 0.609,
        "volAvg": 51090306,
        "mktCap": 159707732802,
        "lastDiv": 0.58,
        "range": "12.2-20.98",
        "changes": 0.15,
        "companyName": "Huatai Securities Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000LQ8",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Financial - Capital Markets",
        "website": "https://www.htsc.com.cn",
        "description": "Huatai Securities Co., Ltd., a security company, provides financial services in Mainland China and internationally. The company buys and sells stocks, funds, bonds, futures, and options on behalf of clients; and provides various financial products and asset allocation, margin financing, securities lending, securities-backed lending, and margin securities lending services. It also offers institutional investment banking services, such as equity and bond underwriting, financial consultancy, and over-the-counter business services for enterprises, institutions, and governments; cross-border proprietary and credit derivative products and services; custodian and fund services, including settlement, liquidation, reporting, and valuation services, as well as margin trading and other value-added services to various asset management institutions; and professional research and consulting services. In addition, the company provides private equity fund and asset management services for securities and futures companies, funds, etc. Huatai Securities Co., Ltd. was founded in 1990 and is headquartered in Nanjing, the People's Republic of China.",
        "ceo": "Yi Zhou",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "16964",
        "phone": "86 25 8338 9999",
        "address": "Huatai Securities Plaza",
        "city": "Nanjing",
        "state": null,
        "zip": "210019",
        "dcfDiff": -12.65793,
        "dcf": 29.057925416644856,
        "image": "https://images.financialmodelingprep.com/symbol/601688.SS.png",
        "ipoDate": "2010-02-26",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601766.SS": {
        "symbol": "601766.SS",
        "price": 7.47,
        "beta": 0.566,
        "volAvg": 64162494,
        "mktCap": 201323525916,
        "lastDiv": 0.2,
        "range": "6.26-8.99",
        "changes": 0,
        "companyName": "CRRC Corporation Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000CP9",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Railroads",
        "website": "https://www.crrcgc.cc",
        "description": "CRRC Corporation Limited and its subsidiaries research, design, develop, manufacture, sell, refurbish, service, and lease locomotives and rolling stock in Mainland China and internationally. It provides rolling stock, which includes electric and diesel locomotives, trains, EMU, DMU, metro cars, LRVs, coaches, wagons, and track machinery; components, such as motors, electric control equipment, locomotive components, vehicle components, and casting and forging; and other products, which include trucks, buses, construction machineries, turnouts, wind turbines, and intelligent machines. The company also offers engineering machinery, electromechanical equipment, electronic equipment and parts, electric products, and environmental protection equipment, as well as technical services and equipment leasing of related products. In addition, it provides information consultation, industry investment and management services; asset management; and import and export services. The company was formerly known as CSR Corporation Limited and changed its name to CRRC Corporation Limited in June 2015. The company was incorporated in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "ceo": "Yongcai Sun",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "152082",
        "phone": "86 10 5186 2188",
        "address": "No. 16 Central West Fourth Ring Road",
        "city": "Beijing",
        "state": null,
        "zip": "100036",
        "dcfDiff": -3.89587,
        "dcf": 11.365870789364527,
        "image": "https://images.financialmodelingprep.com/symbol/601766.SS.png",
        "ipoDate": "2008-08-18",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601800.SS": {
        "symbol": "601800.SS",
        "price": 8.95,
        "beta": 0.322,
        "volAvg": 23891394,
        "mktCap": 124451077527,
        "lastDiv": 0.43261,
        "range": "7.07-12.28",
        "changes": 0.03,
        "companyName": "China Communications Construction Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100001FN5",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Engineering & Construction",
        "website": "https://ccccltd.cn",
        "description": "China Communications Construction Company Limited, together with its subsidiaries, engages in the infrastructure construction, design, and dredging businesses. The company is involved in the construction of various infrastructure projects, including port, waterway, land reclamation, river basin management, road and bridge, railway, urban rail transit, municipal infrastructure, and construction and environmental protection projects; and provision of infrastructure design services, such as consulting and planning, feasibility study, survey and design, engineering consultancy, engineering measurement and technical research, project management, project supervision, general project contracting, compilation of industry standards and codes, etc. It also provides dredging services primarily comprising infrastructure dredging, maintenance dredging, environmental dredging, land reclamation, and watershed management, as well as supports projects related to dredging and land reclamation. In addition, the company engages in the manufacture of road construction machinery; trading of motor vehicle spare parts and machinery; maintenance and design of port machinery; trading of construction materials and equipment; and fund management and financial leasing services. It has operations in Mainland China, Australia, Hong Kong, Africa, the Middle East, and South East Asia. The company was incorporated in 2006 and is based in Beijing, the People's Republic of China. China Communications Construction Company Limited operates as a subsidiary of China Communications Construction Group (Ltd.).",
        "ceo": "Tongzhou Wang",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "137471",
        "phone": "86 10 8201 6562",
        "address": "No.85 De Sheng Men Wai Street",
        "city": "Beijing",
        "state": null,
        "zip": "100088",
        "dcfDiff": null,
        "dcf": 0,
        "image": "https://images.financialmodelingprep.com/symbol/601800.SS.png",
        "ipoDate": "2012-03-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601818.SS": {
        "symbol": "601818.SS",
        "price": 4.27,
        "beta": 0.424,
        "volAvg": 139093903,
        "mktCap": 252432729522,
        "lastDiv": 0.277,
        "range": "2.98-4.5",
        "changes": -0.04,
        "companyName": "China Everbright Bank Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000SL4",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Regional",
        "website": "https://www.cebbank.com",
        "description": "China Everbright Bank Company Limited provides a range of financial products and services to corporations and government agencies, retail customers, and individuals in Mainland China, Hong Kong, Luxembourg, Seoul, and Sydney. The company operates through Corporate Banking, Retail Banking, Financial Market Business, and Others segments. It offers demand, time, pledged, notice, RMB general and intelligent agreement, structured, and other deposits, as well as certificates of deposit; working capital, fixed asset, project financing, syndicated, entrusted, auto, and other loans; personal loans and advances; overdraft facilities; and credit and debit cards. The company also provides bills acceptance, investment banking, trade finance, agency, cash management, financial consulting and advisory, remittance and settlement, guarantee, wealth management, securities agency, inter-bank money market transactions and investment, repurchase transactions, equity investment and related, leasing, capital market, asset management, treasury, custody, and other financial services, as well as online, mobile, and private banking services. In addition, it trades in debt securities, derivatives, and foreign currency accounts. As of December 31, 2021, it operated 1,304 branches and outlets covering 150 economic center cities across the country. The company was founded in 1992 and is headquartered in Beijing, China.",
        "ceo": "Cheng Hao",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "47982",
        "phone": "86 10 6363 6363",
        "address": "China Everbright Center",
        "city": "Beijing",
        "state": null,
        "zip": "100033",
        "dcfDiff": -5.05445,
        "dcf": 8.864450334992744,
        "image": "https://images.financialmodelingprep.com/symbol/601818.SS.png",
        "ipoDate": "2010-08-18",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601857.SS": {
        "symbol": "601857.SS",
        "price": 8.91,
        "beta": 0.781,
        "volAvg": 114785240,
        "mktCap": 1597585577584,
        "lastDiv": 0.47,
        "range": "7.33-10.56",
        "changes": -0.07,
        "companyName": "PetroChina Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000007Q1",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Oil & Gas Integrated",
        "website": "https://www.petrochina.com.cn",
        "description": "PetroChina Company Limited, together with its subsidiaries, engages in a range of petroleum related products, services, and activities in Mainland China and internationally. It operates through Exploration and Production, Refining and Chemicals, Marketing, and Natural Gas and Pipeline segments. The Exploration and Production segment engages in the exploration, development, production, and marketing of crude oil and natural gas. The Refining and Chemicals segment refines crude oil and petroleum products; and produces and markets primary petrochemical products, derivative petrochemical products, and other chemical products. The Marketing segment is involved in marketing of refined products and trading business. The Natural Gas and Pipeline segment engages in the transmission of natural gas, crude oil, and refined products; and sale of natural gas. As of December 31, 2021, the company had a total length of 26,076 km, including 17,329 km of natural gas pipelines, 7,340 km of crude oil pipelines, and 1,407 km of refined product pipelines. The company is also involved in the exploration, development, and production of oil sands and coalbed methane; trading of crude oil and petrochemical products; storage, chemical engineering, storage facilities, service station, and transportation facilities and related businesses; and production and sales of basic and derivative chemical, and other chemical products. The company was founded in 1999 and is headquartered in Beijing, the People's Republic of China. PetroChina Company Limited is a subsidiary of China National Petroleum Corporation.",
        "ceo": "Hua Wang",
        "sector": "Energy",
        "country": "CN",
        "fullTimeEmployees": "370799",
        "phone": "86 10 5998 2622",
        "address": "9 Dongzhimen North Street",
        "city": "Beijing",
        "state": null,
        "zip": "100007",
        "dcfDiff": -6.31967,
        "dcf": 15.229671959722209,
        "image": "https://images.financialmodelingprep.com/symbol/601857.SS.png",
        "ipoDate": "2007-11-05",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601888.SS": {
        "symbol": "601888.SS",
        "price": 61.65,
        "beta": 1.171,
        "volAvg": 12673162,
        "mktCap": 120370392000,
        "lastDiv": 7.53081,
        "range": "53.52-84.92",
        "changes": 0.5,
        "companyName": "China Tourism Group Duty Free Corporation Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000G29",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Specialty Retail",
        "website": "https://www.ctgdutyfree.com.cn",
        "description": "China Tourism Group Duty Free Corporation Limited operates duty-free shops in China. The company engages in the wholesale and retail of duty-free commodities, such as tobacco and alcohol, incense, and fine products. It is also involved in travel retail business, as well as commercial complex investment and development business. The company was formerly known as China International Travel Service Corporation Limited and changed its name to China Tourism Group Duty Free Corporation Limited in June 2020. The company was founded in 1954 and is based in Beijing, China. China Tourism Group Duty Free Corporation Limited is a subsidiary of China Tourism Group Co., Ltd.",
        "ceo": "Zhujun Chang",
        "sector": "Consumer Cyclical",
        "country": "CN",
        "fullTimeEmployees": "16027",
        "phone": "86 10 8447 8866",
        "address": "Block A, No. 2, Dongzhimen Waixiaojie",
        "city": "Beijing",
        "state": null,
        "zip": "100027",
        "dcfDiff": 4.9656,
        "dcf": 56.684403601694655,
        "image": "https://images.financialmodelingprep.com/symbol/601888.SS.png",
        "ipoDate": "2009-10-15",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601939.SS": {
        "symbol": "601939.SS",
        "price": 9.66,
        "beta": 0.382,
        "volAvg": 92422942,
        "mktCap": 2053327812118,
        "lastDiv": 2.07418,
        "range": "6.97-10.03",
        "changes": -0.06,
        "companyName": "China Construction Bank Corporation",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000742",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Diversified",
        "website": "https://www.ccb.com",
        "description": "China Construction Bank Corporation provides various banking and related financial services to individuals and corporate customers in the People's Republic of China and internationally. It operates through Corporate Banking, Personal Banking, Treasury Business, and Others segments. The company accepts various deposits, such as foreign currency, all in one accounts, RMB, corporate term and notification, and corporate demand deposits, as well corporate deposits by agreement. Its loan products include personal business, car, and housing loans; and SME, traditional credit, commercial draft, buyer credit, and RMB credit line loans. The company also offers credit cards; physical gold for personal investment and personal gold accounts; foreign exchange services; certificate treasury and savings bonds, securities deposit accounts, and securities services, as well as bank-securities transfer and book-entry treasury bond over the counter services; and wealth management products. In addition, it provides collection, salaries payment, third-party collection and payment, insurance agency, and remittance services; international settlement and financing, and FI services; securities and fund settlement services; guarantee-based, consulting and advising, and factoring services; fund custody services; and e-banking services. Further, the company offers institutional services comprising services for government agencies, social security, banks cooperation, bank-securities cooperation, bank-insurance cooperation, and services for non-banking financial institutions. It operates 14,741 banking outlets. China Construction Bank Corporation was founded in 1954 and is headquartered in Beijing, the People's Republic of China.",
        "ceo": "Yi Zhang",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "376847",
        "phone": "86 10 6621 5533",
        "address": "No. 25, Financial Street",
        "city": "Beijing",
        "state": null,
        "zip": "100033",
        "dcfDiff": -12.01274,
        "dcf": 19.932738308123763,
        "image": "https://images.financialmodelingprep.com/symbol/601939.SS.png",
        "ipoDate": "2007-09-25",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601988.SS": {
        "symbol": "601988.SS",
        "price": 5.67,
        "beta": 0.278,
        "volAvg": 274619607,
        "mktCap": 1555697362275,
        "lastDiv": 1.23041,
        "range": "4.55-5.9",
        "changes": -0.04,
        "companyName": "Bank of China Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE000001N05",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Banks - Diversified",
        "website": "https://www.boc.cn",
        "description": "Bank of China Limited, together with its subsidiaries, provides various banking and financial services. It operates through six segments: Corporate Banking, Personal Banking, Treasury Operations, Investment Banking, Insurance, and Other Operations. The Corporate Banking segment offers current accounts, deposits, overdrafts, loans, trade-related products and other credit facilities, foreign currency, derivatives, and wealth management products to corporate customers, government authorities, and financial institutions. The Personal Banking segment provides savings deposits, personal loans, credit and debit cards, payments and settlements, wealth management products, and funds and insurance agency services to retail customers. The Treasury Operations segment is involved in foreign exchange transactions, customer-based interest rate and foreign exchange derivative transactions, money market transactions, proprietary trading, and asset and liability management. The Investment Banking segment offers debt and equity underwriting, financial advisory, stock brokerage, investment research and asset management, and private equity investment services, as well as sells and trades in securities. The Insurance segment underwrites general and life insurance products; and provides insurance agency services. As of December 31, 2021, the company had 10,382 branches and outlets, which include 520 institutions in the Chinese mainland and 550 institutions in Hong Kong, Macao, Taiwan, and other countries. It is also involved in the aircraft leasing business. The company was founded in 1912 and is headquartered in Beijing, China.",
        "ceo": "Haijiao Ge",
        "sector": "Financial Services",
        "country": "CN",
        "fullTimeEmployees": "312757",
        "phone": "86 10 6659 6688",
        "address": "No. 1 Fuxingmen Nei Dajie",
        "city": "Beijing",
        "state": null,
        "zip": "100818",
        "dcfDiff": 5.04854,
        "dcf": -0.20854397632834434,
        "image": "https://images.financialmodelingprep.com/symbol/601988.SS.png",
        "ipoDate": "2006-07-05",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "601989.SS": {
        "symbol": "601989.SS",
        "price": 4.65,
        "beta": 0.556,
        "volAvg": 119401045,
        "mktCap": 106029300000,
        "lastDiv": 0.13919,
        "range": "3.82-6.05",
        "changes": 0.06,
        "companyName": "China Shipbuilding Industry Company Limited",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100000J75",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Aerospace & Defense",
        "website": "https://www.csicl.com.cn",
        "description": "China Shipbuilding Industry Company Limited engages in the shipbuilding and ship support, marine equipment, marine transportation equipment, ship repair and modification, and other businesses in China. The company offers marine defense and marine development equipment; deep-sea equipment; ship repair and modification, ship supporting mechanical, and electrical equipment; and marine scientific research equipment. It also offers naval equipment, such as aircraft carriers, submarines; large, medium and small surface combat ships, large amphibious assault ship, and military auxiliary ships. The company offers civilian products, such as bulk carriers, container ships, and oil tankers. In addition, it provides wind power, solar thermal, nuclear power, and other energy equipment; ship ballast water systems; energy-saving; and environmental protection equipment. The company was incorporated in 2008 and is based in Kunming, China.",
        "ceo": "Zuhui Yao",
        "sector": "Industrials",
        "country": "CN",
        "fullTimeEmployees": "27681",
        "phone": "86 10 8850 8596",
        "address": "No. 72, Kunming Lake South Road",
        "city": "Kunming",
        "state": null,
        "zip": "100097",
        "dcfDiff": -3.53229,
        "dcf": 8.182285486761163,
        "image": "https://images.financialmodelingprep.com/symbol/601989.SS.png",
        "ipoDate": "2009-12-16",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "603259.SS": {
        "symbol": "603259.SS",
        "price": 81.02,
        "beta": 0.741,
        "volAvg": 33619810,
        "mktCap": 236800997913,
        "lastDiv": 0.35,
        "range": "36.86-81.49",
        "changes": 2.21,
        "companyName": "WuXi AppTec Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE1000031K4",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Medical - Diagnostics & Research",
        "website": "https://www.wuxiapptec.com",
        "description": "WuXi AppTec Co., Ltd., an investment holding company, provides research, development, and manufacturing services to discover, develop, and manufacture small molecule drugs, and cell and gene therapies in the People's Republic of China, rest of Asia, the United States, Europe, and internationally. The company operates through six segments: WuXi Chemistry, WuXi Testing, WuXi Biology, WuXi ATU, WuXi DDSU, and Others. It offers contract research, development, and manufacturing organization services for new drug development from discovery to commercial covering various categories for various synthetic molecular modalities, including small molecules, oligonucleotides, peptides, and complex conjugates; and biology services and solutions that support stand-alone and integrated projects from target discovery to candidate selection and into the clinic. The company also provides seamless drug and medical device testing services from preclinical testing to clinical trials; an integrated end-to-end solution to accelerate time to market for cell and gene therapies; drug discovery services to pharmaceutical and biotech customers; and clinical research services. WuXi AppTec Co., Ltd. was founded in 2000 and is headquartered in Shanghai, the People's Republic of China.",
        "ceo": "Ge Li",
        "sector": "Healthcare",
        "country": "CN",
        "fullTimeEmployees": "39414",
        "phone": "86 21 5046 1111",
        "address": "288 Fute Zhong Road",
        "city": "Shanghai",
        "state": null,
        "zip": "200131",
        "dcfDiff": 3.77203,
        "dcf": 77.24797136725589,
        "image": "https://images.financialmodelingprep.com/symbol/603259.SS.png",
        "ipoDate": "2018-05-08",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    },
    "603993.SS": {
        "symbol": "603993.SS",
        "price": 8.09,
        "beta": 1.25,
        "volAvg": 166706877,
        "mktCap": 172205101749,
        "lastDiv": 0.15425,
        "range": "5.91-9.55",
        "changes": -0.02,
        "companyName": "China Molybdenum Co., Ltd.",
        "currency": "CNY",
        "cik": null,
        "isin": "CNE100001NR0",
        "cusip": null,
        "exchange": "Shanghai Stock Exchange",
        "exchangeShortName": "SHH",
        "industry": "Industrial Materials",
        "website": "https://www.cmoc.com",
        "description": "China Molybdenum Co., Ltd., together with its subsidiaries, engages in the mining, beneficiation, smelting, refining, and trading of copper, cobalt, molybdenum, tungsten, niobium, phosphates, and other base and rare metals. The company provides molybdenum oxide, ferromolybdenum, molybdenum and tungsten concentrates, copper concentrate, cobalt hydroxide, ferroniobium, phosphate fertilizer, gold and silver, and other related products. It is also involved in the refining and sale of mineral products; purchase and sale of molybdenum and tungsten products; import and export of goods and technology; and hotel management, consulting, enterprise operating and management, asset management, logistics, and transportation businesses. It has operations in China, Australia, Brazil and the Democratic Republic of the Congo, Switzerland, and internationally. China Molybdenum Co., Ltd. was incorporated in 2006 and is based in Luoyang, the People's Republic of China.",
        "ceo": "Ruiwen Sun",
        "sector": "Basic Materials",
        "country": "CN",
        "fullTimeEmployees": "12317",
        "phone": "86 37 9686 03993",
        "address": "North of Yihe",
        "city": "Luoyang",
        "state": null,
        "zip": "471500",
        "dcfDiff": 0.53819,
        "dcf": 7.551808492059957,
        "image": "https://images.financialmodelingprep.com/symbol/603993.SS.png",
        "ipoDate": "2012-10-09",
        "defaultImage": false,
        "isEtf": false,
        "isActivelyTrading": true,
        "isAdr": false,
        "isFund": false
    }
}